<a href="https://colab.research.google.com/github/Charanjeev-2k2/Car-Insurance-Prediction/blob/main/Car_Insurance_Notebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Importing Libraries and Data

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
df = pd.read_csv("Train_data.csv") #df1 for train
df2 = pd.read_csv("Test_data.csv") #df2 for test

Exploratory Data Analysis (EDA)

In [ ]:
df.shape

(3102, 18)

In [ ]:
df2.shape

(935, 17)

In [ ]:
df.head()

         age     job_type marital_status  ... call_start  call_end  car_insurance
0  47.000000  blue-collar        married  ...   10:22:20  10:24:29              0
1  46.031442   management        married  ...   09:06:30  13:59:48              1
2  36.000000     services         single  ...   13:18:41  13:27:16              1
3  32.000000   technician         single  ...   10:09:18  10:21:48              1
4  30.000000       admin.         single  ...   12:12:30  12:27:14              1

[5 rows x 18 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3102 entries, 0 to 3101
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   age                  3102 non-null   float64
 1   job_type             3091 non-null   object
 2   marital_status       3102 non-null   object
 3   education_level      2989 non-null   object
 4   default_or_not       3102 non-null   int64
 5   balance_amt          3102 non-null   float64
 6   household_insurance  3102 non-null   int64
 7   car_loan             3102 non-null   int64
 8   communication        2559 non-null   object
 9   last_contact_day     3102 non-null   int64
 10  last_contact_month   3102 non-null   object
 11  no_of_contacts       3102 non-null   int64
 12  days_passed          3102 non-null   int64
 13  prev_attempts        3102 non-null   int64
 14  Outcome              751 non-null    object
 15  call_start           3102 non-null   object
 16  call_end             3102 non-null   object
 17  car_insurance        3102 non-null   int64
dtypes: float64(2), int64(8), object(8)
memory usage: 436.3+ KB

In [ ]:
df.describe()

               age  default_or_not  ...  prev_attempts  car_insurance
count  3102.000000     3102.000000  ...    3102.000000    3102.000000
mean     41.325847        0.014507  ...       0.792392       0.567376
std      11.517698        0.119587  ...       2.224740       0.495520
min      18.000000        0.000000  ...       0.000000       0.000000
25%      32.000000        0.000000  ...       0.000000       0.000000
50%      39.000000        0.000000  ...       0.000000       1.000000
75%      49.000000        0.000000  ...       1.000000       1.000000
max      92.000000        1.000000  ...      58.000000       1.000000

[8 rows x 10 columns]

In [ ]:
alpha = df.corr()
alpha["car_insurance"]

age                    0.048778
default_or_not        -0.046430
balance_amt            0.041643
household_insurance   -0.183577
car_loan              -0.070349
last_contact_day      -0.068710
no_of_contacts        -0.134481
days_passed            0.096490
prev_attempts          0.120926
car_insurance          1.000000
Name: car_insurance, dtype: float64

In [ ]:
df.head(10)

         age     job_type marital_status  ... call_start  call_end  car_insurance
0  47.000000  blue-collar        married  ...   10:22:20  10:24:29              0
1  46.031442   management        married  ...   09:06:30  13:59:48              1
2  36.000000     services         single  ...   13:18:41  13:27:16              1
3  32.000000   technician         single  ...   10:09:18  10:21:48              1
4  30.000000       admin.         single  ...   12:12:30  12:27:14              1
5  37.000000   management        married  ...   10:15:03  10:18:47              1
6  30.000000  blue-collar        married  ...   10:51:56  10:57:43              0
7  21.000000      student         single  ...   10:10:32  10:12:27              0
8  52.091704       admin.        married  ...   16:42:19  16:52:35              1
9  49.000000   technician        married  ...   15:33:44  15:55:17              1

[10 rows x 18 columns]

In [ ]:
df2.head(10)

         age    job_type marital_status  ...  Outcome  call_start  call_end
0  65.000000     retired        married  ...      NaN    12:22:13  12:30:56
1  36.000000  management        married  ...      NaN    17:59:45  18:07:40
2  37.000000  management        married  ...  success    14:05:19  14:10:56
3  30.065066  management         single  ...      NaN    17:33:27  09:47:54
4  41.000000  management        married  ...      NaN    14:40:26  14:41:31
5  33.000000  management         single  ...      NaN    13:47:37  13:51:33
6  46.000000  management        married  ...    other    11:23:26  11:34:24
7  39.126336      admin.        married  ...      NaN    13:07:45  10:57:45
8  58.000000     retired        married  ...  success    15:27:52  15:30:25
9  48.000000  technician        married  ...      NaN    10:11:43  10:11:48

[10 rows x 17 columns]

#Data  Cleaning and Preprocessing

In [ ]:
df["age"] = df['age'].astype(int)
df2["age"] = df2['age'].astype(int)

In [ ]:
x = pd.to_datetime(df["call_start"].values, format = "%H:%M:%S")
y = pd.to_datetime(df["call_end"].values, format = "%H:%M:%S")

a = pd.to_datetime(df2["call_start"].values, format = "%H:%M:%S")
b = pd.to_datetime(df2["call_end"].values, format = "%H:%M:%S")

In [ ]:
df.dtypes

age                      int64
job_type                object
marital_status          object
education_level         object
default_or_not           int64
balance_amt            float64
household_insurance      int64
car_loan                 int64
communication           object
last_contact_day         int64
last_contact_month      object
no_of_contacts           int64
days_passed              int64
prev_attempts            int64
Outcome                 object
call_start              object
call_end                object
car_insurance            int64
dtype: object

In [ ]:
df2.dtypes

age                      int64
job_type                object
marital_status          object
education_level         object
default_or_not           int64
balance_amt            float64
household_insurance      int64
car_loan                 int64
communication           object
last_contact_day         int64
last_contact_month      object
no_of_contacts           int64
days_passed              int64
prev_attempts            int64
Outcome                 object
call_start              object
call_end                object
dtype: object

In [ ]:
df["call_time"] = y - x
df2["call_time"] = b-a

In [ ]:
df.head()

   age     job_type marital_status  ...  call_end  car_insurance       call_time
0   47  blue-collar        married  ...  10:24:29              0 0 days 00:02:09
1   46   management        married  ...  13:59:48              1 0 days 04:53:18
2   36     services         single  ...  13:27:16              1 0 days 00:08:35
3   32   technician         single  ...  10:21:48              1 0 days 00:12:30
4   30       admin.         single  ...  12:27:14              1 0 days 00:14:44

[5 rows x 19 columns]

In [ ]:
df2.head()

   age    job_type marital_status  ... call_start  call_end         call_time
0   65     retired        married  ...   12:22:13  12:30:56   0 days 00:08:43
1   36  management        married  ...   17:59:45  18:07:40   0 days 00:07:55
2   37  management        married  ...   14:05:19  14:10:56   0 days 00:05:37
3   30  management         single  ...   17:33:27  09:47:54 -1 days +16:14:27
4   41  management        married  ...   14:40:26  14:41:31   0 days 00:01:05

[5 rows x 18 columns]

In [ ]:
df["call_time"] = df["call_time"].astype(int) // 10 ** 9
df2["call_time"] = df2["call_time"].astype(int) // 10 ** 9

In [ ]:
df.dtypes

age                      int64
job_type                object
marital_status          object
education_level         object
default_or_not           int64
balance_amt            float64
household_insurance      int64
car_loan                 int64
communication           object
last_contact_day         int64
last_contact_month      object
no_of_contacts           int64
days_passed              int64
prev_attempts            int64
Outcome                 object
call_start              object
call_end                object
car_insurance            int64
call_time                int64
dtype: object

In [ ]:
df2.dtypes

age                      int64
job_type                object
marital_status          object
education_level         object
default_or_not           int64
balance_amt            float64
household_insurance      int64
car_loan                 int64
communication           object
last_contact_day         int64
last_contact_month      object
no_of_contacts           int64
days_passed              int64
prev_attempts            int64
Outcome                 object
call_start              object
call_end                object
call_time                int64
dtype: object

In [ ]:
df.head()

   age     job_type marital_status  ...  call_end  car_insurance  call_time
0   47  blue-collar        married  ...  10:24:29              0        129
1   46   management        married  ...  13:59:48              1      17598
2   36     services         single  ...  13:27:16              1        515
3   32   technician         single  ...  10:21:48              1        750
4   30       admin.         single  ...  12:27:14              1        884

[5 rows x 19 columns]

In [ ]:
df_miss_val = df.isnull().sum()
(df_miss_val[df_miss_val > 0]/df.shape[0]) * 100

job_type            0.354610
education_level     3.642811
communication      17.504836
Outcome            75.789813
dtype: float64

In [ ]:
#Percentage of missing values
df2_miss_val = df2.isnull().sum()
(df2_miss_val[df2_miss_val > 0]/df2.shape[0]) * 100

job_type            0.534759
education_level     3.636364
communication      17.647059
Outcome            74.331551
dtype: float64

In [ ]:
df.replace({"last_contact_month": {"jan" : "1", "feb": "2", "mar": "3", "apr": "4", "may": "5", "jun": "6", "jul": "7", "aug": "8", "sep": "9", "oct":"10", "nov": "11", "dec":"12"}}, inplace = True)
df2.replace({"last_contact_month": {"jan" : "1", "feb": "2", "mar": "3", "apr": "4", "may": "5", "jun": "6", "jul": "7", "aug": "8", "sep": "9", "oct":"10", "nov": "11", "dec":"12"}}, inplace = True)

In [ ]:
df["date"] = df["last_contact_day"].astype(str) + "/" + df["last_contact_month"] + "/2019"
df2["date"] = df2["last_contact_day"].astype(str) + "/" + df2["last_contact_month"] + "/2019"

In [ ]:
df.head()

   age     job_type marital_status  ... car_insurance  call_time       date
0   47  blue-collar        married  ...             0        129  13/5/2019
1   46   management        married  ...             1      17598  15/5/2019
2   36     services         single  ...             1        515  16/5/2019
3   32   technician         single  ...             1        750  29/1/2019
4   30       admin.         single  ...             1        884  14/5/2019

[5 rows x 20 columns]

In [ ]:
df2.head()

   age    job_type marital_status  ...  call_end  call_time       date
0   65     retired        married  ...  12:30:56        523   8/4/2019
1   36  management        married  ...  18:07:40        475  15/5/2019
2   37  management        married  ...  14:10:56        337   7/9/2019
3   30  management         single  ...  09:47:54     -27933  14/5/2019
4   41  management        married  ...  14:41:31         65  29/7/2019

[5 rows x 19 columns]

In [ ]:
df["days_passed"] = pd.to_datetime(df["date"].values, format = "%d/%M/%Y")
df2["days_passed"] = pd.to_datetime(df2["date"].values, format = "%d/%M/%Y")

In [ ]:
df.describe()

               age  default_or_not  ...  car_insurance     call_time
count  3102.000000     3102.000000  ...    3102.000000   3102.000000
mean     41.235332        0.014507  ...       0.567376   1522.525790
std      11.520326        0.119587  ...       0.495520   7463.072387
min      18.000000        0.000000  ...       0.000000 -30093.000000
25%      32.000000        0.000000  ...       0.000000    134.000000
50%      39.000000        0.000000  ...       1.000000    282.000000
75%      49.000000        0.000000  ...       1.000000    669.750000
max      92.000000        1.000000  ...       1.000000  29733.000000

[8 rows x 10 columns]

In [ ]:
df["days_passed"] = pd.to_datetime("01/01/2030", format= "%d/%M/%Y") - df["days_passed"]
df["days_passed"] = df["days_passed"].astype(int) // 10 ** 9

In [ ]:
df2["days_passed"] = pd.to_datetime("01/01/2030", format= "%d/%M/%Y") - df2["days_passed"]
df2["days_passed"] = df["days_passed"].astype(int) // 10 ** 9

In [ ]:
df

      age      job_type marital_status  ... car_insurance  call_time       date
0      47   blue-collar        married  ...             0        129  13/5/2019
1      46    management        married  ...             1      17598  15/5/2019
2      36      services         single  ...             1        515  16/5/2019
3      32    technician         single  ...             1        750  29/1/2019
4      30        admin.         single  ...             1        884  14/5/2019
...   ...           ...            ...  ...           ...        ...        ...
3097   44    technician         single  ...             0         13   6/5/2019
3098   57        admin.        married  ...             0         47  16/5/2019
3099   51  entrepreneur        married  ...             1        267  20/4/2019
3100   61   blue-collar        married  ...             1        562   6/8/2019
3101   53    technician        married  ...             1        781   1/6/2019

[3102 rows x 20 columns]

In [ ]:
df2

     age     job_type marital_status  ...  call_end  call_time        date
0     65      retired        married  ...  12:30:56        523    8/4/2019
1     36   management        married  ...  18:07:40        475   15/5/2019
2     37   management        married  ...  14:10:56        337    7/9/2019
3     30   management         single  ...  09:47:54     -27933   14/5/2019
4     41   management        married  ...  14:41:31         65   29/7/2019
..   ...          ...            ...  ...       ...        ...         ...
930   31  blue-collar        married  ...  16:41:53        831    8/7/2019
931   30   technician         single  ...  15:37:10        352   18/7/2019
932   42   management        married  ...  11:49:47        664  21/11/2019
933   46     services        married  ...  13:32:48        893  21/11/2019
934   54  blue-collar        married  ...  18:07:52        520   18/8/2019

[935 rows x 19 columns]

In [ ]:
alpha = df.corr()
alpha["car_insurance"]

age                    0.041905
default_or_not        -0.046430
balance_amt            0.041643
household_insurance   -0.183577
car_loan              -0.070349
last_contact_day      -0.068710
no_of_contacts        -0.134481
days_passed            0.068703
prev_attempts          0.120926
car_insurance          1.000000
call_time              0.153943
Name: car_insurance, dtype: float64

In [ ]:
train = df.drop(columns = ["Outcome", "communication", "call_start", "call_end", "last_contact_day", "last_contact_month"], inplace = False)
test = df2.drop(columns = ["Outcome", "communication", "call_start", "call_end", "last_contact_day", "last_contact_month"], inplace = False)

In [ ]:
train.head()

   age     job_type marital_status  ... car_insurance  call_time       date
0   47  blue-collar        married  ...             0        129  13/5/2019
1   46   management        married  ...             1      17598  15/5/2019
2   36     services         single  ...             1        515  16/5/2019
3   32   technician         single  ...             1        750  29/1/2019
4   30       admin.         single  ...             1        884  14/5/2019

[5 rows x 14 columns]

In [ ]:
test.head()

   age    job_type marital_status  ... prev_attempts  call_time       date
0   65     retired        married  ...             0        523   8/4/2019
1   36  management        married  ...             0        475  15/5/2019
2   37  management        married  ...             1        337   7/9/2019
3   30  management         single  ...             0     -27933  14/5/2019
4   41  management        married  ...             0         65  29/7/2019

[5 rows x 13 columns]

In [ ]:
#Data Imputation
from sklearn.impute import SimpleImputer
# missing values - impute with mode (most frequent)
mode_imputer = SimpleImputer(missing_values=np.NaN, strategy='most_frequent')
mode_imputer = mode_imputer.fit(train[['job_type']])
train['job_type'] = mode_imputer.transform(train[['job_type']]).ravel()

mode_imputer = SimpleImputer(missing_values=np.NaN, strategy='most_frequent')
mode_imputer = mode_imputer.fit(train[['education_level']])
train['education_level'] = mode_imputer.transform(train[['education_level']]).ravel()


mode_imputer = SimpleImputer(missing_values=np.NaN, strategy='most_frequent')
mode_imputer = mode_imputer.fit(test[['job_type']])
test['job_type'] = mode_imputer.transform(test[['job_type']]).ravel()

mode_imputer = SimpleImputer(missing_values=np.NaN, strategy='most_frequent')
mode_imputer = mode_imputer.fit(test[['education_level']])
test['education_level'] = mode_imputer.transform(test[['education_level']]).ravel()

In [ ]:
train.isnull().sum()

age                    0
job_type               0
marital_status         0
education_level        0
default_or_not         0
balance_amt            0
household_insurance    0
car_loan               0
no_of_contacts         0
days_passed            0
prev_attempts          0
car_insurance          0
call_time              0
date                   0
dtype: int64

In [ ]:
test.isnull().sum()

age                    0
job_type               0
marital_status         0
education_level        0
default_or_not         0
balance_amt            0
household_insurance    0
car_loan               0
no_of_contacts         0
days_passed            0
prev_attempts          0
call_time              0
date                   0
dtype: int64

In [ ]:
train.dtypes

age                      int64
job_type                object
marital_status          object
education_level         object
default_or_not           int64
balance_amt            float64
household_insurance      int64
car_loan                 int64
no_of_contacts           int64
days_passed              int64
prev_attempts            int64
car_insurance            int64
call_time                int64
date                    object
dtype: object

In [ ]:
job_type = pd.get_dummies(data=train['job_type'], drop_first=True)
marital_status = pd.get_dummies(data=train['marital_status'], drop_first=True)
education_level = pd.get_dummies(data=train['education_level'], drop_first=True)
train = pd.concat((job_type, marital_status, education_level,train), axis = 1 )


job_type = pd.get_dummies(data=test['job_type'], drop_first=True)
marital_status = pd.get_dummies(data=test['marital_status'], drop_first=True)
education_level = pd.get_dummies(data=test['education_level'], drop_first=True)
test = pd.concat((job_type, marital_status, education_level,test), axis = 1 )

In [ ]:
print("There are {} features in train set".format(len(train.columns)))

print("There are {} features in test set".format(len(test.columns)))

There are 28 features in train set
There are 27 features in test set

In [ ]:
missing_feature = list(set(train.columns) - set(test.columns))[0]

print(missing_feature)

car_insurance

In [ ]:
train.drop(columns = ["job_type", "marital_status", "education_level","date"], inplace = True)

y = train["car_insurance"].values
X = train.drop(columns = "car_insurance", inplace = False)
X = X.values

In [ ]:
test.drop(columns = ["job_type", "marital_status", "education_level","date"], inplace = True)

In [ ]:
#Splitting Data
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.25, random_state = 0)
print(X_train.shape, y_train.shape)
print(X_test.shape, y_test.shape)

(2326, 23) (2326,)
(776, 23) (776,)

In [ ]:
train.dtypes

blue-collar              uint8
entrepreneur             uint8
housemaid                uint8
management               uint8
retired                  uint8
self-employed            uint8
services                 uint8
student                  uint8
technician               uint8
unemployed               uint8
married                  uint8
single                   uint8
secondary                uint8
tertiary                 uint8
age                      int64
default_or_not           int64
balance_amt            float64
household_insurance      int64
car_loan                 int64
no_of_contacts           int64
days_passed              int64
prev_attempts            int64
car_insurance            int64
call_time                int64
dtype: object

In [ ]:
test.dtypes

blue-collar              uint8
entrepreneur             uint8
housemaid                uint8
management               uint8
retired                  uint8
self-employed            uint8
services                 uint8
student                  uint8
technician               uint8
unemployed               uint8
married                  uint8
single                   uint8
secondary                uint8
tertiary                 uint8
age                      int64
default_or_not           int64
balance_amt            float64
household_insurance      int64
car_loan                 int64
no_of_contacts           int64
days_passed              int64
prev_attempts            int64
call_time                int64
dtype: object

#**Building and Evaluating different Machine Learning models**

#DTREE

In [ ]:
from sklearn.tree import DecisionTreeClassifier
DTmodel = DecisionTreeClassifier()
DTmodel.fit(X_train, y_train)
y_pred_DT = DTmodel.predict(X_test)
DTmodel.score(X_test, y_test)

0.7551546391752577

In [ ]:
from sklearn.tree import DecisionTreeClassifier
DTmodel = DecisionTreeClassifier()
DTmodel.fit(X_train, y_train)
y_pred_DT = DTmodel.predict(test)

In [ ]:
prediction = pd.DataFrame(y_pred_DT, columns=["prediction"])

In [ ]:
prediction.to_csv("Charanjeev_Submission.csv", index = False)

#KNN

In [ ]:
from sklearn.neighbors import KNeighborsClassifier
KNNmodel = KNeighborsClassifier(n_neighbors = 5)
KNNmodel.fit(X_train, y_train)
y_pred_KNN = KNNmodel.predict(X_test)
KNNmodel.score(X_test, y_test)

0.7306701030927835

In [ ]:
from sklearn.neighbors import KNeighborsClassifier
KNNmodel = KNeighborsClassifier(n_neighbors = 5)
KNNmodel.fit(X_train, y_train)
y_pred_KNN = KNNmodel.predict(test)
prediction = pd.DataFrame(y_pred_KNN, columns=["prediction"])
prediction.to_csv("Charanjeev_Submission_KNN.csv", index = False)

#LR

In [ ]:
from sklearn.linear_model import LogisticRegression
LRmodel = LogisticRegression(random_state = 0)
LRmodel.fit(X_train, y_train)
y_predict_LR = LRmodel.predict(X_test)
LRmodel.score(X_test, y_test)

0.5618556701030928

In [ ]:
from sklearn.linear_model import LogisticRegression
LRmodel = LogisticRegression(random_state = 0)
LRmodel.fit(X_train, y_train)
y_predict_LR = LRmodel.predict(test)
prediction = pd.DataFrame(y_predict_LR, columns=["prediction"])
prediction.to_csv("Charanjeev_Submission_LR.csv", index = False)

#SVM

In [ ]:
from sklearn.svm import SVC
SVMmodel = SVC(random_state = 0)
SVMmodel.fit(X_train, y_train)
y_pred_SVM = SVMmodel.predict(X_test)
SVMmodel.score(X_test, y_test)

0.5618556701030928

In [ ]:
from sklearn.svm import SVC
SVMmodel = SVC(random_state = 0)
SVMmodel.fit(X_train, y_train)
y_pred_SVM = SVMmodel.predict(test)
prediction = pd.DataFrame(y_pred_SVM, columns=["prediction"])
prediction.to_csv("Charanjeev_Submission_SVM.csv", index = False)

#RF

In [ ]:
from sklearn.ensemble import RandomForestClassifier
RFmodel = RandomForestClassifier(random_state = 0, n_estimators=210)
RFmodel.fit(X_train, y_train)
y_pred_RF = RFmodel.predict(X_test)
RFmodel.score(X_test, y_test)

0.8530927835051546

Since the best Accuracy is for Random Forest Classifier.
Thus, its prediction file is used for submission

#Prediction for test dataset

In [ ]:
from sklearn.ensemble import RandomForestClassifier
RFmodel = RandomForestClassifier(random_state = 0, n_estimators=210)
RFmodel.fit(X_train, y_train)
y_predict_RF = RFmodel.predict(test)
prediction = pd.DataFrame(y_predict_RF, columns=["prediction"])
prediction.to_csv("Charanjeev_Submission_RF.csv", index = False)